project03 | soapkit example/soapkit-example/src/main/resources/sample/validRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ank="http://ankuran.online/">
	<soapenv:Header />
	<soapenv:Body>
		<ank:requestedPersonInfo xmlns:ank="http://ankuran.online/">
			<arg0>
				<firstName>Ankur</firstName>
				<middleName>Jyoti</middleName>
				<lastName>Bhuyan</lastName>
				<email>webmail.ajb@ankuran.online</email>
				<gender>Male</gender>
				<phone>9590951212</phone>
			</arg0>
		</ank:requestedPersonInfo>
	</soapenv:Body>
</soapenv:Envelope>